target/test-classes/xml/ocs/TC4994_Create_Subscriber_Request_Msg.xml

<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
    <SOAP-ENV:Header/>
    <S:Body xmlns:ns2="http://www.huawei.com/bme/cbsinterface/bcservices" xmlns:ns3="http://www.huawei.com/bme/cbsinterface/cbscommon" xmlns:ns4="http://www.huawei.com/bme/cbsinterface/bccommon">
        <ns2:CreateSubscriberRequestMsg>
            <CreateSubscriberRequest>
                <ns2:RegisterCustomer OpType="2">
                    <ns2:CustKey>$accountNumber$</ns2:CustKey>
                </ns2:RegisterCustomer>
                <ns2:Account>
                    <ns2:AcctKey>$AcctKey$A</ns2:AcctKey>
                    <ns2:AcctInfo>
                        <ns4:BillCycleType>02</ns4:BillCycleType>
                        <ns4:PaymentType>1</ns4:PaymentType>
                    </ns2:AcctInfo>
                </ns2:Account>
                <ns2:Subscriber>
                    <ns2:SubscriberKey>$AcctKey$S</ns2:SubscriberKey>
                    <ns2:SubscriberInfo>
                        <ns4:UserCustomerKey>$accountNumber$</ns4:UserCustomerKey>
                        <ns4:SubIdentity>
                            <ns4:SubIdentityType>1</ns4:SubIdentityType>
                            <ns4:SubIdentity>7388927730</ns4:SubIdentity>
                            <ns4:PrimaryFlag>1</ns4:PrimaryFlag>
                        </ns4:SubIdentity>
                        <ns4:ConsumptionLimit>
                            <ns4:LimitType>SAFETY_BUFFER</ns4:LimitType>
                            <ns4:UnitType>M</ns4:UnitType>
                            <ns4:CurrencyID>1052</ns4:CurrencyID>
                            <ns4:LimitValue>20000</ns4:LimitValue>
                        </ns4:ConsumptionLimit>
                    </ns2:SubscriberInfo>
                    <ns2:SubPaymentMode>
                        <ns2:PaymentMode>1</ns2:PaymentMode>
                        <ns2:PayRelationKey>$AcctKey$A</ns2:PayRelationKey>
                        <ns2:AcctKey>$AcctKey$A</ns2:AcctKey>
                    </ns2:SubPaymentMode>
                </ns2:Subscriber>
                <ns2:PrimaryOffering>
                    <ns4:OfferingKey>
                        <ns4:OfferingCode>C_Safety_Buffer_Tariff</ns4:OfferingCode>
                    </ns4:OfferingKey>
                    <ns4:OfferingInstProperty>
                        <ns4:PropCode>C_LEGACY_OFFERCODE</ns4:PropCode>
                        <ns4:PropType>1</ns4:PropType>
                        <ns4:Value>FC36-1000-100</ns4:Value>
                    </ns4:OfferingInstProperty>
                    <ns2:EffectiveTime>20191023000000</ns2:EffectiveTime>
                </ns2:PrimaryOffering>
                <ns2:SupplementaryOffering>
                    <ns4:OfferingKey>
                        <ns4:OfferingCode>C_Core_Data</ns4:OfferingCode>
                        <ns4:PurchaseSeq>67863458</ns4:PurchaseSeq>
                    </ns4:OfferingKey>
                    <ns4:OInstProperty>
                        <ns4:PropCode>C_DIY_DATA_AMOUNT</ns4:PropCode>
                        <ns4:PropType>1</ns4:PropType>
                        <ns4:Value>512000</ns4:Value>
                    </ns4:OInstProperty>
                    <ns2:EffectiveTime>
                        <ns4:Mode>I</ns4:Mode>
                    </ns2:EffectiveTime>
                </ns2:SupplementaryOffering>
                <ns2:SupplementaryOffering>
                    <ns4:OfferingKey>
                        <ns4:OfferingCode>C_Core_Minutes_PAYM</ns4:OfferingCode>
                        <ns4:PurchaseSeq>$AcctKey$</ns4:PurchaseSeq>
                    </ns4:OfferingKey>
                    <ns4:OInstProperty>
                        <ns4:PropCode>C_DIY_VOICE_AMOUNT</ns4:PropCode>
                        <ns4:PropType>1</ns4:PropType>
                        <ns4:Value>6000</ns4:Value>
                    </ns4:OInstProperty>
                    <ns2:EffectiveTime>
                        <ns4:Mode>I</ns4:Mode>
                    </ns2:EffectiveTime>
                </ns2:SupplementaryOffering>
                <ns2:SupplementaryOffering>
                    <ns4:OfferingKey>
                        <ns4:OfferingCode>C_Core_SMS</ns4:OfferingCode>
                        <ns4:PurchaseSeq>$AcctKey$</ns4:PurchaseSeq>
                    </ns4:OfferingKey>
                    <ns4:OInstProperty>
                        <ns4:PropCode>C_DIY_SMS_AMOUNT</ns4:PropCode>
                        <ns4:PropType>1</ns4:PropType>
                        <ns4:Value>5000</ns4:Value>
                    </ns4:OInstProperty>
                    <ns2:EffectiveTime>
                        <ns4:Mode>I</ns4:Mode>
                    </ns2:EffectiveTime>
                </ns2:SupplementaryOffering>
            </CreateSubscriberRequest>
        </ns2:CreateSubscriberRequestMsg>
    </S:Body>
</S:Envelope>